import re

# Регулярные выражения для форматов:
# "ДДММГГГГ", "ДД-ММ-ГГГГ", "ДД.ММ.ГГГГ" , "ДД_ММ_ГГГГ", ,"ГГГГ-ММ-ДД","ГГГГ-ММ-ДД ЧЧ-ММ ТЕКСТ", "ММ.ГГГГ", ММГГГГ, "Месяц"
DATE_FORMATS = {
    "%d%m%Y": re.compile(r"(0[1-9]|[12]\d|3[01])(0[1-9]|1[0-2])\d{4}"),
    "%d-%m-%Y": re.compile(r"(0[1-9]|[12]\d|3[01])\-(0[1-9]|1[0-2])\-\d{4}"),
    "%d.%m.%Y": re.compile(r"(0[1-9]|[12]\d|3[01])\.(0[1-9]|1[0-2])\.\d{4}"),
    "%d_%m_%Y": re.compile(r"(0[1-9]|[12]\d|3[01])_(0[1-9]|1[0-2])_\d{4}"),
    "%Y%m%d": re.compile(r"\d{4}(0[1-9]|1[0-2])(0[1-9]|[12]\d|3[01])"),
    "%Y-%m-%d %H-%M": re.compile(
        r"\d{4}\-(0[1-9]|1[0-2])\-(0[1-9]|[12]\d|3[01])\s(0\d|1\d|2[0-3])\-(0\d|[1-5]\d)"),
    "%Y-%m-%d": re.compile(r"\d{4}\-(0[1-9]|1[0-2])\-(0[1-9]|[12]\d|3[01])"),
    "%m.%Y": re.compile(r"(0[1-9]|1[0-2])\.\d{4}"),
    '%m.%y': re.compile(r"(0[1-9]|1[0-2])\.\d{2}"),
    "%m%Y": re.compile(r"(0[1-9]|1[0-2])\d{4}"),
    "%Y": re.compile(r"\d{4}"),
    "%B": re.compile(
        r"(?:Январь|Февраль|Март|Апрель|Май|Июнь|Июль|Август|Сентябрь|Октябрь|Ноябрь|Декабрь)",
        re.IGNORECASE)
}

USER_DATE_FORMAT_TO_RE_COMPILE = {
    "ГГГГ-ММ-ДД ЧЧ-ММ": re.compile(
        r"\d{4}\-(0[1-9]|1[0-2])\-(0[1-9]|[12]\d|3[01])\s(0\d|1\d|2[0-3])\-(0\d|[1-5]\d)"),
    "ГГГГ-ММ-ДД": re.compile(r"\d{4}\-(0[1-9]|1[0-2])\-(0[1-9]|[12]\d|3[01])"),
    "ДДММГГГГ": re.compile(r"(0[1-9]|[12]\d|3[01])(0[1-9]|1[0-2])\d{4}"),
    "ДД_ММ_ГГГГ": re.compile(r"(0[1-9]|[12]\d|3[01])_(0[1-9]|1[0-2])_\d{4}"),
    "ДД.ММ.ГГГГ": re.compile(r"(0[1-9]|[12]\d|3[01])\.(0[1-9]|1[0-2])\.\d{4}"),
    "ММГГГГ": re.compile(r"(0[1-9]|1[0-2])\d{4}"),
    "ММ.ГГГГ": re.compile(r"(0[1-9]|1[0-2])\.\d{4}"),
    "ММ.Месяц": re.compile(
        r"\d{2}\.(?:Январь|Февраль|Март|Апрель|Май|Июнь|Июль|Август|Сентябрь|Октябрь|Ноябрь|Декабрь)", re.IGNORECASE),
    "ММ.ГГ": re.compile(r"(0[1-9]|1[0-2])\.\d{2}"),
    "ГГГГ": re.compile(r"\d{4}")

}
USER_SEASON_FORMAT_OPTIONS = {
    "ГГГГ-ММ-ДД ЧЧ-ММ": "%Y-%m-%d %H-%M",
    "ГГГГ-ММ-ДД": "%Y-%m-%d",
    "ДДММГГГГ": "%d%m%Y",
    "ДД_ММ_ГГГГ": "%d_%m_%Y",
    "ДД.ММ.ГГГГ": "%d.%m.%Y",
    "ММГГГГ": "%m%Y",
    "ММ.ГГГГ": "%m.%Y",
    "ММ.Месяц": "%B",
    "ММ.ГГ": '%m.%y',
    "ГГГГ": "%Y",

}
MONTH_NAMES = {
    "Январь": 1, "Февраль": 2, "Март": 3, "Апрель": 4,
    "Май": 5, "Июнь": 6, "Июль": 7, "Август": 8,
    "Сентябрь": 9, "Октябрь": 10, "Ноябрь": 11, "Декабрь": 12
}
